[
  {
    "id": 1,
    "title": "Don’t Make Fun of My Mom",
    "subtitle": "Said my daughter as I tucked her in last night.",
    "body": "As a child, I often got bullied. I never stood up for myself. I internalized negative comment after negative comment. Last night, I shared this with my daughter. I told her the story because she stood up to her bully. She looked at me and said, if I were with you when you were a little girl, I’d say don’t make fun of my mom. At that moment, I felt accomplished. I was proud to have raised an incredible human being with kindness and strength. I tucked her in, told her I was proud of her, and kissed her good night. I went to bed happy. Kindness solves most problems. I’ve always been nice to a fault. This, unfortunately, resulted in many failed relationships. I allowed men to take advantage of me. The truth about kindness is that it can easily go into overdrive. Yet despite these failed relationships, I continue to teach my children to be kind. The neighbor no one wants to play with, my kids do. They’ve been taught to be nice. They’ve been taught to stand up for someone if he’s getting bullied. They have been taught this because I stayed quiet for too long. When I woke up today, I thought about the lessons my children have taught me. They’ve made me stronger. My daughter has taught me to be an advocate for myself. My son has shown me to stay true to myself. If I struggle with a decision, he tells me to think about what I want. If I have a temporary bout of self-doubt, he corrects me. No, Mommy, you’re beautiful. No, Mommy, the chicken is delicious. Without my children, I’m not sure where I’d be. They have contributed so much to my growth as a person. I would be lost without them. There’s a fine balance teaching your children your mistakes and allowing them to make their own. You want to fix all their problems but can’t. This is why my daughter standing up for herself, made me so proud. She did it on her own. She didn’t need me to step in. She didn’t rely on me. She heard something she didn’t like, said she wouldn’t play with the child, and left. She wasn’t bothered. She was born sticking up for herself. At age two, she got mad if you interrupted her. At age five, I received a letter from school on her emotional awareness. She’s smart and strong. And while I have learned many a lesson from her, I am confident she learned how to react to bullies from me. You can easily say that I’m a mess if my children, ages 8 and 6, teach me life lessons. I look at it differently. I am lucky to have created such wonderful people. My occasional lack of confidence and kindness have made them understand the importance of being nice. Maybe if more of us showed our vulnerabilities to our children, the world would be a better place.",
    "date": "November, 13, 2020"
  },
  {
    "id": 2,
    "title": "Hike With Your Children",
    "subtitle": "Their growth is your responsibility.",
    "body": "We hike every weekend. It’s a hobby I did with my husband before children, one I maintained while pregnant and one we continue to engage in as the children grow. I love being outside and smelling the outdoors. I love being able to walk miles and miles and engage in conversation. I love feeling free. No commitments. No milestones. We walk until we are ready to stop. With every step we take, I grow closer to my children. I hear about school, their friends, crushes, and upcoming things they are excited about. I learn more about them every time I go. We’ve gotten to the point where a 4-mile hike is average. The kids expect to hike that much. In the picture above, we completed 7 miles on the Appalachian Trail in Pennsylvania. The kids had a blast. The sticks they are holding were also known as their “wizard staffs.” They found them somewhere along mile 5 and ended up bringing them home. They sang Army songs with their father. They told me about how they miss their friends. They complained about being tired at mile 6. The last mile was tough. The kids were ready to stop. I danced my way out to keep them entertained. In the end, they were exhausted. I was so proud of them for pushing through and hiking that long. We praised and praised them. During their complaints, I asked myself why. Why do we make them struggle? We make them struggle, so they grow. We push them outside of their comfort zones so they won’t have a zone, to begin with. We push our children to be better than we were at their age. We do this because it is our responsibility. We do this because you can’t overcome if you don’t struggle. We do this because we want them to have memories. I don’t remember the dolls I had growing up, but I do remember camping with my family. I remember it so fondly that you’d think we camped often growing up. It was a single time. We went camping one time, yet the memory is ingrained in my mind. It was one of the best moments of my childhood. I want my children to have those moments. I want them to remember our weekends fondly. Their wizard staff. My dancing as I walked down the trail. My husband singing “Left, Left, Left, Right, Left.” I want them to remember it all. You become abundantly aware of how time flies after you have children. We only have a certain amount of years to make an impact on their lives, teach them, and set them on the right path. You can’t do this watching television. You can’t teach your child the importance of finding purpose in watching tv. But after they’ve hiked 7 tough miles and can see what they are capable of, they are ready to listen. They feel proud of their accomplishments and understand struggle leads to success. Ever notice that you are less stressed when you engage in one activity for a certain amount of time. Your mind finds its focus. Hiking is simple — one step in front of the other. But the mere act of walking gives you so much. I’ve noticed complaints usually disappear by mile 1. That’s when the children start running ahead of us. Hiking has given them independence. They run ahead and learn how to lead. They’ve been given freedom. Freedom to explore. We have evenings at home in front of the tv when my daughter randomly asks to go hiking. It’s not uncommon. She’s used to it. In fact, when one of us gets tired of the monotony, we want to go hiking. What we’ve learned about ourselves and each other during our hikes has made us very close as a family. That is why everyone should hike with their children. It is so much more than the act of hiking; it contributes to the children’s growth and yours as a family.",
    "date": "November 5, 2020"
  },
  {
    "id": 3,
    "title": "After 20 Years, My Best Friend and I Parted Ways. It’s Taken Me a Year to Realize I’m Okay with It.",
    "subtitle": " ",
    "body": "Last year, I broke up with my best friend of 20 years. Our falling out was much like a break up. We were as close as family. She helped plan my wedding. She planned my bachelorette party and my baby shower. She planned my baby sprinkle for my second pregnancy. She was my go-to person. We spoke often and met up at least once a month for dinner and drinks. A year ago, we stopped talking. A couple months later, we were at a good friend's wedding and seated at separate tables. It was one of the most awkward and immature experiences of my life. As I've had time to reflect, I wish I could go back to that wedding. I could have pulled her aside. I could have discussed what happened and maybe we could have mended our friendship. It's wishful thinking. We were slowly growing apart. There was an event which triggered our separation, but I don’t think it matters. Our separation was inevitable. Over the years, as we got married and had children, there was an underlying comparison between the two of us. If I hiked with my husband, she and her husband would go the next weekend. I was happy she found hobbies and supportive of her discovering what made her happy. As the years passed, I lost interest in our dinner dates. I wanted to actually do something together. I wanted to engage in an activity. Drinking wine and eating appetizers weren't enough. I should have invested time in our friendship. I should have suggested alternatives to dinner and drinks. The times we did meet up, she was focused on her side hustles and I was focused on my anti-hustle. She wanted to spend her evenings in things that would establish her brand. I wanted to spend mine in learning something new. We didn’t seem to understand each other. I struggled with our friendship. I assumed it was normal to have issues with each other and recover. Only, I didn’t do that. I didn’t discuss what was on my mind. I kept it to myself. I allowed her to talk about her side hustles, nodding in agreement, all the while thinking she should be focused in improving herself instead. I struggled with understanding why we were at two different places in our lives. I allowed us to continue in the downward spiral until one day it was too much, for the both of us. Without even a conversation to discuss our friendship, we were done. It’s been a year and a half since we last spoke. She texted me when my grandmother passed earlier this year. I thanked her. I will always want the best for her and her children. I miss her children. They were good friends with mine, and I considered them my nieces. But, that part of my life is over. Over time, I’ve accepted the loss of our friendship. It wasn’t meant to last a lifetime. As we often joked we’d be causing havoc in our shared nursing home, I don’t think we were meant to get there together. Maybe one day we will speak again. While I don’t know what the future holds, I do know I’m okay with it. I have realized we were moving in different directions. While it’s true your friends don’t have to be in similar life situations as you, both parties should want to invest time to grow the friendship. You should want to engage in activities without comparison. You should want to talk about your self-awareness. You should want to spend time together. You should want to make memories. You should want to start hobbies together. Towards the end of our friendship, I didn’t want to spent time together. I didn’t recognize the person that was once my friend. It could have been me, it could have her, but it’s likely both of us. We grew apart. I’m aware this sounds like a sob story. If I’m so aware we grew apart, why can’t we engage in things together now? Why can't we work on our friendship? I don’t know the answer. I do know I don’t regret our friendship. I don’t regret the many years we were by each other’s sides. I’m happy I got to experience those moments. However, I don’t want those moments now. As I age and discover more about myself, I’ve understood what makes me happy. I want to be around people that have similar mindsets, the less is more mindset. The mindset to find what makes you happy and do it. I want to be around those with the growth mindset, those that want to learn, continuously. I want to be surrounded by people I admire. I want to learn from them. When I initially thought about the friends I want to have, I felt selfish. Shouldn’t I accept everyone for who they are? Does it matter that we’re not growing together? Love should be enough. Unfortunately, it’s not. It’s not enough in a marriage, and it’s not enough in a friendship. You need to invest time in your friendship. You need to do things that will make memories. Dinner and drinks don’t make memories. Engaging in a challenging activity and accomplishing something together, that’s a memory in the making. I love hiking. It is one of my most favorite hobbies, yet I have never hiked with my ex best friend. We didn’t do those types of activities together. Years ago, I wondered why we were limited to dinner and drinks. Prior to having children, I was at the rock-climbing gym with my husband a couple times a week. I never rock climbed with my friend. The most we did was take a hair braiding class together. It was fun and while we both tried what we learned on our daughters, I wanted more. I wanted to be able to spend time with her where we were both learning, growing and enjoying each other’s company. While I’m not sure if we will ever speak, I do now that I am content. I feel a weight lifted from my shoulders. Sometimes we need consider who we surround ourselves with and do what’s best for ourselves. I’ve reflected on my friendship a lot this past year and while I am grateful for the memories we’ve had; I am finally okay with not being friends anymore. There is no more comparison. I am free to be me. And I’ve realized that’s enough.",
    "date": "December 28, 2020"
  },
  {
    "id": 4,
    "title": "Not All Who Wander Are Lost",
    "subtitle": "In fact, they are found.",
    "body": "Some of my favorite memories are from hikes I’ve done with my family. It’s not the actual hiking I remember, it’s a beautiful view or a deep conversation. It’s who I hiked with, what we spoke about, and getting tired yet continuing to walk. We love to be outside. When we can’t get outside as often as we normally do, our dynamic changes. The kids are bored, they annoy us more, we annoy them, they argue, we fight. Nothing good comes out of us being cooped up at home. When we wander, we unite. We explore. We have deep conversations. I learn about a new friend my daughter made or that a kid yelled at my son on the bus. I know what they are looking forward to and what they are struggling with. I bond with them. When I see my husband walk with my children, I feel their love. It’s not hiking, it’s being outside together. It’s making memories together. It’s having another experience to talk about. This is what unites us. This is what keeps us happy. Today we drove an hour and a half away and did a 3 mile hike in 30 degrees. We were all bundled up. We were tired. We have been used to sitting on the couch under a blanket this past month. But we absolutely needed to get outside. We needed to walk uphill holding hands. We needed to look at trees and rocks. Most of all, we needed to talk. Hiking has been therapeutic for my husband and me. We started years ago before our children were born. It’s been our way of connecting — our way of making time to have conversation, discussing the week, work, and life. Through our many hiking trips, some more challenging than others, we have found ourselves. We have strengthened our relationship. We’ve even planned vacations around hiking and came home feeling more united. It’s not easy driving over an hour away with two children fighting in the backseat but we do it anyways. It’s not easy getting up early on the weekend but we do it nonetheless. When the children have soccer and sports on Saturdays, we go on Sundays. It’s important to us and them. With recent events, it’s been difficult to take an entire day to hike. My daughter brought this up two weeks ago. We asked her what she wanted to do and she said hike. We’re proud of that. It’s just as important to our children as it is to us. Today’s hike met expectations. We talked about school and what the children wanted for Christmas. My daughter, obsessed with eating healthy and exercising, spoke about how healthy she is. We laughed. We smiled. We hiked. We enjoyed each other’s company. Afterwards, we grabbed lunch and drove home. The children slept the entire way. Happy we were able to get back outside, my husband and I had time to talk when the kids fell asleep. Hiking has made us realize we don’t need a lot to be happy. When we keep things simple, we’re happier. The fact the my daughter asked to go for a hike, instead of to Target to buy toys makes me proud. She’s found the same value in hiking we have. We’ve taken this concept and applied it to vacations as well. Our South Dakota trip was one of the simplest vacations we’ve taken to date and it’s on the top of the list. There is nothing more enjoyable than easy. And by easy I mean simple. Our hikes were challenging but everything else we did was low key and simple. We came home relaxed and united. Hiking has allowed me to focus on the things that matter. Through hiking I’ve discovered that the majority of the things I thought I wanted don’t matter. Bigger house, luxury car — these things don’t add value. What adds value to my life is memories made with my husband and children. Wandering has given me self-awareness. It’s made me understand what I value and its given me many memorable moments with my family. It’s united my husband and I several times during rough spells and given my children the ability to challenge themselves and overcome. I don’t wander because I’m lost, I wander because I’m found.",
    "date": "November 18, 2019"
  }
]
